//-----------------------------------------------------------------
// 程序描述:
// 	   SPI驱动头文件
// 作    者: 凌智电子
// 开始日期: 2018-08-04
// 完成日期: 2018-08-04
// 修改日期: 
// 当前版本: V1.0
// 历史版本:
//  - V1.0: (2018-08-04)SPI驱动
// 调试工具: 凌智STM32F429+Cyclone IV电子系统设计开发板、LZE_ST_LINK2
// 说    明: 
//    
//-----------------------------------------------------------------
#ifndef _SPI_H
#define _SPI_H
#include "sys.h"
#include "delay.h"
//-----------------------------------------------------------------
// 句柄声明
//-----------------------------------------------------------------
extern SPI_HandleTypeDef SPI4_Handler; // SPI句柄

//-----------------------------------------------------------------
// 外部函数声明
//-----------------------------------------------------------------
void SPI4_Init(void);
void SPI4_SetSpeed(u8 SPI_BaudRatePrescaler);
u8 SPI4_ReadWrite_Byte(u8 dat);
void SPI4_Send_Byte(u8 dat);
u8 SPI4_Read_Byte(void);

#endif

//-----------------------------------------------------------------
// End Of File
//----------------------------------------------------------------- 
