//-----------------------------------------------------------------
// 程序描述:
//      ADS1292模块测试程序
// 作    者: 凌智电子
// 开始日期: 2020-09-01
// 完成日期: 2020-09-05
// 修改日期:
// 当前版本: V1.0
// 历史版本:
//  - V1.0:  
// 调试工具: 凌智STM32F429+Cyclone IV电子系统设计开发板、LZE_ST_LINK2, 使用串口调试助手显示心电图
// 说    明: 接口说明
//           ADS1292模块      开发板
// 					   START      ->   PE7
// 						 PWDN   		->   PE8
// 						 DRDY   		->   PE9
// 						 CS  	 			->   PE10
// 						 GPIO1  		->   PE11
// 						 GPIO2  		->   PE12
// 						 SCLK   		->   PF7
// 						 DOUT   		->   PF8
// 						 DIN    		->   PF9
//             5V 				->   +5V
//						 GND				->	 GND

//-----------------------------------------------------------------

//-----------------------------------------------------------------
// 头文件包含
//-----------------------------------------------------------------
#include "stm32f429_winner.h"
#include "delay.h"
#include "key.h"
#include "led.h"
#include "usart.h"
#include "ads1292.h"
#include "spi.h"
//-----------------------------------------------------------------

//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
int main(void)
{
  u32 ch1_data;
  u32 ch2_data;
  u8 read_data[9];								 	 // 数据缓存区
  HAL_Init();                        // 初始化HAL库
  SystemClock_Config(360, 25, 2, 8); // 设置时钟,180Mhz
  uart_init(115200);                 // 初始化USART
  LED_Init();                        // 初始化LED
  ADS1292_Init();										 // ADS1292引脚初始化
  ADS1292_PowerOnInit();						 // ADS1292上电初始化
  while (1)
  {
    ch1_data = 0;										 // 通道1数据
    ch2_data = 0;										 // 通道2数据

		// read_data：24 status bits + 24 bits × 2 channels
    ADS1292_Read_Data(read_data);
		
		// 计算ADS1292R通道1的数据-呼吸测量数据
    ch1_data |= (uint32_t)read_data[3] << 16;
    ch1_data |= (uint32_t)read_data[4] << 8;
    ch1_data |= (uint32_t)read_data[5] << 0;

		// 计算ADS1292R通道2的数据-心电图数据
    ch2_data |= (uint32_t)read_data[6] << 16;
    ch2_data |= (uint32_t)read_data[7] << 8;
    ch2_data |= (uint32_t)read_data[8] << 0;

		// 得到的数据是补码，需要进行数据转换
    printf("A: %8d,%8d\n",ch1_data^0x800000, ch2_data^0x800000);
  }
}
//-----------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------
