#ifndef __INCLUDES_H
#define __INCLUDES_H

#include "ad9959.h"//PI0,1,4,5,6,7
#include "inneradc.h"//PA5
//#include "led.h"//PB0,1
//#include "lcd.h"//PD0,1,4,5,7,8,9,10,13,14,15//PE7,8,9,10,11,12,13,14,15
#include "key.h"//PH2,PH3,PA0

//#include "ads1256.h"//PH14,15//PI0,1,4,5,7
//#include "olediic.h"// PH12,13
//#include "oledspi.h"// PH9,10,11,12,13
//#include "zlg7290.h"//PH9,10,11//PI7
//#include "24l01.h"//PG10,12//PI11//PB13,14,15
//#include "hmc830.h"//PE2,3,4,5,6
//#include "roll.h"//PC4,5
//#include "uartlcd.h"//PA2,3
//#include "fpga_spi.h"//PB13,14,15//PH9
//#include "mpu.h"
//#include "ad8302.h"//PA4,5//PC4,5
//#include "ad9957_eval.h"//PE2,3,4,6//PC5//PE5
//#include "tjc_usartlcd.h"//PA2,3
//#include "atkesp8266.h"//PB10,PB11
//#include "ads1274.h"//PH12,13,14,15


#include "iap.h"
//#include "rng.h"
#include "sdram.h"//PC0,2,3//PD0,1,8,9,10,14,15//PE0,1,7,8,9,10,11,12,13,14,15//PF0,1,2,3,4,5,11,12,13,14,15//PG0,1,2,4,5,8,15 
/**********************资源分配表************************************************
GPIO
PA 0_   1    2__  3__  4_   5__  6    7    8    9    10    11    12    13    14    15
PB 0_   1_   2    3    4    5    6    7    8    9    10_   11_   12_   13_   14_   15_
PC 0_   1    2_   3_   4__  5___ 6    7    8    9    10    11    12    13    14    15
PD 0__  1__  2    3    4_   5_   6    7_   8__  9__  10__  11    12    13_   14__  15__
PE 0_   1_   2__  3__  4__  5__  6__  7__  8__  9__  10__  11__  12__  13__  14__  15__
PF 0_   1_   2_   3_   4_   5_   6    7    8    9    10    11_   12_   13_   14_   15_
PG 0_   1_   2_   3    4_   5_   6    7    8_   9    10__  11    12__  13    14    15_
PH 0    1    2_   3_   4    5    6    7    8    9__  10__  11__  12___ 13___ 14__  15__
PI 0__  1__  2    3    4__  5__  6_   7___ 8    9    10    11__
********************************************************************************/
//计数变量溢出陷入死循环，数据未按照预期写入导致内存非法访问，
//统一局部变量接口，多事件共享局部变量技术，单一事件多局部变量技术
//要注意的是，如果多个事件共用一个局部变量，则该变量不可同时当做两个事件的控制变量
//其中控制变量的数目应当和事件数相同，即一一对应，该技术只是为了访问数据而已
//采样串技术，分辨率和采样率，采样串无打扰原则
//小事件内插技术
//事件命名规范
//错误函数处理 debug_log 
//数据名重定义技术

#endif
